const arr_biqubook = [
    ["团宠小可爱成了满级大佬"],
    ["被大佬们团宠后我野翻了"],
    ["当满级大佬翻车以后"],
    ["每天被迫和大佬谈恋爱！"],
    ["下堂王妃逆袭记"],
    ["他那么撩"],
    ["神医嫡女"],
    ["天医凤九！"],
    ["我家太子妃超凶的！"],
    ["偷偷藏不住"],
    ["神医弃女，鬼抵的驭兽"],
    ["夫人你马甲又掉了！"],
    ["时光和你都很美！"],
    ["恰是寒光是骄阳"],
    [""],
    [""],
    [""], 
];

const arr_manhau = [
    ["星辰于我"],
    ["只要恋爱才能防止黑化"],
    ["恰是寒光是骄阳"],
    ["奇怪的苏兮"],
    ["我家娘子竟然是女帝"],
    ["她又又又上热搜了"],
    ["奶萌魔力小公主"],
    ["萌师在上"],
    ["暴君闺女五岁半"],
    ["鲛人崽崽三岁了"],
    ["萌动兽世"],
    ["龙王追妻"],
    ["忽如一夜病娇来"],
    ["退退退退下"],
    ["养敌为患"],
    ["偷偷藏不住"],
    ["我什么时候无敌了"],
    ["淑女想休息"],
    ["皇女殿下很邪恶"],
    ["我打造了长生俱乐部"],
    ["大佬要嫁盲夫君"],
    ["穿成恶毒女配后被男生们偷听心声"],
    ["我把皇子养黑化了"],
    ["逆徒每天都想欺师犯上"],
    ["白日梦我"],
    [""],
    [""],
    [""],
];
// console.log(arr_biqubook[1][0]);
// console.log(arr_biqubook.length);
var str1 = "<h4>小说</h4><ul>";
for (let i = 0; i < arr_biqubook.length; i++) {
    str1 += `<li>${arr_biqubook[i][0]}</li>`;
}
str1 += `</ul>`;
getDOM("#box1").innerHTML = str1;

var str2 = "<h4>漫画</h4><ul>";
for (let i = 0; i < arr_manhau.length; i++) {
    str2 += `<li>${arr_manhau[i][0]}</li>`;
}
str2 += `</ul>`;
getDOM("#box2").innerHTML = str2;

function getDOM(text) {
    return document.querySelector(text);
}